In [1]:
import pandas as pd

In [2]:
# dictonary를 df 로 변환
dict_data = {'c0':[1,2,3], 'c1':[4,5,6]}
df=pd.DataFrame(dict_data, index=['r0','r1','r2'])
df

    c0  c1
r0   1   4
r1   2   5
r2   3   6

In [3]:
col0=df['c0']
col0

r0    1
r1    2
r2    3
Name: c0, dtype: int64

In [4]:
col1=df.c1
col1

r0    4
r1    5
r2    6
Name: c1, dtype: int64

In [5]:
df['c2']=7,8,9
df

    c0  c1  c2
r0   1   4   7
r1   2   5   8
r2   3   6   9

In [6]:
df['c3']=0
df

    c0  c1  c2  c3
r0   1   4   7   0
r1   2   5   8   0
r2   3   6   9   0

In [7]:
df['c4']=df['c3']
df

    c0  c1  c2  c3  c4
r0   1   4   7   0   0
r1   2   5   8   0   0
r2   3   6   9   0   0

In [8]:
df['c3']=10,11,12
df

    c0  c1  c2  c3  c4
r0   1   4   7  10   0
r1   2   5   8  11   0
r2   3   6   9  12   0

In [9]:
df['c3']=0
df

    c0  c1  c2  c3  c4
r0   1   4   7   0   0
r1   2   5   8   0   0
r2   3   6   9   0   0

In [10]:
df.drop('c4',axis=1,inplace=True)
df

    c0  c1  c2  c3
r0   1   4   7   0
r1   2   5   8   0
r2   3   6   9   0

In [11]:
df.drop('r1',axis=0, inplace=True)
df

    c0  c1  c2  c3
r0   1   4   7   0
r2   3   6   9   0